jack77er/openUTRUSTA/Packages/.cache/Keil.TM4C_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>TM4C_DFP</name>
  <description>Texas Instruments Tiva C Series Device Support and Examples</description>

  <releases>
    <release version="1.0.0">
      First Release version of Tiva C Series Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Texas Instruments</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Texas Instruments</keyword>
    <keyword>Tiva C</keyword>
    <keyword>TM4C123</keyword>
    <keyword>TM4C129</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="Tiva C Series" Dvendor="Texas Instruments:16">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <book    name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
        <description>
Texas Instruments Tiva C Series MCUs offer the industry’s most popular ARM Cortex-M4 core with
scalable memory and package options, unparalleled connectivity peripherals, and advanced analog integration.
        </description>

      <!-- ************************  Subfamily 'TM4C123x Series'  **************************** -->
      <subFamily DsubFamily="TM4C123x Series">
        <processor Dclock="80000000"/>
        <book name="http://www.ti.com/lsds/ti/arm/arm_cortex_m_microcontrollers/arm_cortex_m4/tm4c123x_mcus/tm4c123x-mcus-overview.page" title="TM4C123x Series - Overview"/>
        <description>
The TM4C123x Series MCUs integrate ARM’s single-precision floating-point core and high-performance analog-to-digital converters
while still providing low-power modes that consume as little 1.6 uA.
With up to 40 PWM outputs, a generous number of serial communication peripherals, USB OTG, and two CAN controllers,
the TM4C123x series provides an excellent baseline for home, building, and industrial applications.
        </description>

      <!-- *************************  Device 'TM4C1230C3PM'  ***************************** -->
      <device Dname="TM4C1230C3PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1230C3PM"/>
        <debug      svd="SVD\TM4C123\TM4C1230C3PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x008000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x003000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_32.FLM"     start="0x00000000"  size="0x008000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1230D5PM'  ***************************** -->
      <device Dname="TM4C1230D5PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1230D5PM"/>
        <debug      svd="SVD\TM4C123\TM4C1230D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1230E6PM'  ***************************** -->
      <device Dname="TM4C1230E6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1230E6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1230E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1230H6PM'  ***************************** -->
      <device Dname="TM4C1230H6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1230H6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1230H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231C3PM'  ***************************** -->
      <device Dname="TM4C1231C3PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231C3PM"/>
        <debug      svd="SVD\TM4C123\TM4C1231C3PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x008000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x003000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_32.FLM"     start="0x00000000"  size="0x008000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231D5PM'  ***************************** -->
      <device Dname="TM4C1231D5PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231D5PM"/>
        <debug      svd="SVD\TM4C123\TM4C1231D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231D5PZ'  ***************************** -->
      <device Dname="TM4C1231D5PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231D5PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1231D5PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231E6PM'  ***************************** -->
      <device Dname="TM4C1231E6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231E6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1231E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231E6PZ'  ***************************** -->
      <device Dname="TM4C1231E6PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231E6PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1231E6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1231H6PGE'  ***************************** -->
      <device Dname="TM4C1231H6PGE">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1231H6PGE"/>
        <debug      svd="SVD\TM4C123\TM4C1231H6PGE.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

