jack77er/openUTRUSTA/Packages/.cache/Keil.TM4C_DFP.1.0.0.pdsc
      <!-- *************************  Device 'TM4C1233H6PGE'  ***************************** -->
      <device Dname="TM4C1233H6PGE">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1233H6PGE"/>
        <debug      svd="SVD\TM4C123\TM4C1233H6PGE.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233H6PM'  ***************************** -->
      <device Dname="TM4C1233H6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1233H6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1233H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1233H6PZ'  ***************************** -->
      <device Dname="TM4C1233H6PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1233H6PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1233H6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1236D5PM'  ***************************** -->
      <device Dname="TM4C1236D5PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1236D5PM"/>
        <debug      svd="SVD\TM4C123\TM4C1236D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1236E6PM'  ***************************** -->
      <device Dname="TM4C1236E6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1236E6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1236E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1236H6PM'  ***************************** -->
      <device Dname="TM4C1236H6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1236H6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1236H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237D5PM'  ***************************** -->
      <device Dname="TM4C1237D5PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237D5PM"/>
        <debug      svd="SVD\TM4C123\TM4C1237D5PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237D5PZ'  ***************************** -->
      <device Dname="TM4C1237D5PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237D5PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1237D5PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x010000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x006000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_64.FLM"     start="0x00000000"  size="0x010000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237E6PM'  ***************************** -->
      <device Dname="TM4C1237E6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237E6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1237E6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237E6PZ'  ***************************** -->
      <device Dname="TM4C1237E6PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237E6PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1237E6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237H6PGE'  ***************************** -->
      <device Dname="TM4C1237H6PGE">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237H6PGE"/>
        <debug      svd="SVD\TM4C123\TM4C1237H6PGE.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237H6PM'  ***************************** -->
      <device Dname="TM4C1237H6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237H6PM"/>
        <debug      svd="SVD\TM4C123\TM4C1237H6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1237H6PZ'  ***************************** -->
      <device Dname="TM4C1237H6PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C1237H6PZ"/>
        <debug      svd="SVD\TM4C123\TM4C1237H6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123AE6PM'  ***************************** -->
      <device Dname="TM4C123AE6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123AE6PM"/>
        <debug      svd="SVD\TM4C123\TM4C123AE6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x020000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_128.FLM"    start="0x00000000"  size="0x020000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123AH6PM'  ***************************** -->
      <device Dname="TM4C123AH6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123AH6PM"/>
        <debug      svd="SVD\TM4C123\TM4C123AH6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

