jack77er/openUTRUSTA/Packages/.cache/Keil.TM4C_DFP.1.0.0.pdsc
      <!-- *************************  Device 'TM4C123GH6PM'  ***************************** -->
      <device Dname="TM4C123GH6PM">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123GH6PM"/>
        <debug      svd="SVD\TM4C123\TM4C123GH6PM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GH6PZ'  ***************************** -->
      <device Dname="TM4C123GH6PZ">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123GH6PZ"/>
        <debug      svd="SVD\TM4C123\TM4C123GH6PZ.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GH6ZRB'  ***************************** -->
      <device Dname="TM4C123GH6ZRB">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123GH6ZRB"/>
        <debug      svd="SVD\TM4C123\TM4C123GH6ZRB.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C123GH6ZXR'  ***************************** -->
      <device Dname="TM4C123GH6ZXR">
        <compile header="Device\Include\TM4C123\TM4C123.h"  define="TM4C123GH6ZXR"/>
        <debug      svd="SVD\TM4C123\TM4C123GH6ZXR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x040000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x008000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C123_256.FLM"    start="0x00000000"  size="0x040000"                 default="1"/>
      </device>

      </subFamily>

      <!-- ************************  Subfamily 'TM4C129x Series'  **************************** -->
      <subFamily DsubFamily="TM4C129x Series">
        <processor Dclock="120000000"/>
        <book name="http://www.ti.com/lsds/ti/arm/arm_cortex_m_microcontrollers/arm_cortex_m4/tm4c129x_mcus/tm4c129x-mcus-overview.page" title="TM4C129x Series - Overview"/>
        <description>
The Tiva TM4C129x MCUs are the industry’s first ARM Cortex-M4-based MCUs with Ethernet MAC+PHY,
enabling customers to create a new class of highly connected products that bridge the cloud and
amplify the ever-growing Internet of Things (IoT).
The Tiva TM4C129x MCUs offer several connectivity options, as well as on-chip data protection and
LCD controller to save board space and enable connected applications, such as home/building automation gateways,
connected human-machine interface (HMI), networked sensor gateways, and many others.
        </description>

      <!-- *************************  Device 'TM4C1290NCPDT'  ***************************** -->
      <device Dname="TM4C1290NCPDT">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C1290NCPDT"/>
        <debug      svd="SVD\TM4C129\TM4C1290NCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1290NCZAD'  ***************************** -->
      <device Dname="TM4C1290NCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C1290NCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C1290NCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1292NCPDT'  ***************************** -->
      <device Dname="TM4C1292NCPDT">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C1292NCPDT"/>
        <debug      svd="SVD\TM4C129\TM4C1292NCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1292NCZAD'  ***************************** -->
      <device Dname="TM4C1292NCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C1292NCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C1292NCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1294KCPDT'  ***************************** -->
      <device Dname="TM4C1294KCPDT">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C1294KCPDT"/>
        <debug      svd="SVD\TM4C129\TM4C1294KCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x080000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_512.FLM"    start="0x00000000"  size="0x080000"                 default="1"/>
      </device>

