jack77er/openUTRUSTA/Packages/.cache/Keil.TM4C_DFP.1.0.0.pdsc
      <!-- *************************  Device 'TM4C129ENCPDT'  ***************************** -->
      <device Dname="TM4C129ENCPDT">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C129ENCPDT"/>
        <debug      svd="SVD\TM4C129\TM4C129ENCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129ENCZAD'  ***************************** -->
      <device Dname="TM4C129ENCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C129ENCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C129ENCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129LNCZAD'  ***************************** -->
      <device Dname="TM4C129LNCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C129LNCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C129LNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129XKCZAD'  ***************************** -->
      <device Dname="TM4C129XKCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C129XKCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C129XKCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x080000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_512.FLM"    start="0x00000000"  size="0x080000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129XNCZAD'  ***************************** -->
      <device Dname="TM4C129XNCZAD">
        <compile header="Device\Include\TM4C129\TM4C129.h"  define="TM4C129XNCZAD"/>
        <debug      svd="SVD\TM4C129\TM4C129XNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash\TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      </subFamily>

    </family>
  </devices>

  <!--
  <boards>
  </boards>
  -->

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TM4C">
      <description>Texas Instruments Tiva C Series devices</description>
      <require Dvendor="Texas Instruments:16" Dname="TM4C12*"/>
    </condition>

    <condition id="TM4C123x">
      <description>Texas Instruments TM4C123x Series devices</description>
      <require Dvendor="Texas Instruments:16" Dname="TM4C123*"/>
    </condition>

    <condition id="TM4C129x">
      <description>Texas Instruments TM4C129x Series devices</description>
      <require Dvendor="Texas Instruments:16" Dname="TM4C129*"/>
    </condition>

    <condition id="TM4C CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Texas Instruments Tiva C Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Texas Instruments:16" Dname="TM4C12*"/>
    </condition>
  </conditions>

  <examples>
    <!-- EK-TM4C129XL Demo Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\TI\EK-TM4C1294XL\Blinky">
      <description>Blinky example</description>
      <board name="EK-TM4C1294XL" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C1294NCPDT"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\TI\EK-TM4C1294XL\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EK-TM4C1294XL" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C1294NCPDT"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- DK-TM4C129x Demo Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\TI\DK-TM4C129x\Blinky">
      <description>Blinky example</description>
      <board name="DK-TM4C129x" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C129XCNZAD"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\TI\DK-TM4C129x\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="DK-TM4C129x" vendor="Texas Instruments" Dvendor="Texas Instruments:16" Dname="TM4C129XCNZAD"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TM4C CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Texas Instruments Tiva C Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>  
        <!-- header path -->
        <file category="header" name="Device\Include\TM4C123\TM4C123.h"                          condition="TM4C123x" />
        <file category="header" name="Device\Include\TM4C129\TM4C129.h"                          condition="TM4C129x" />
        
        
        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TM4C123.s"     attr="config"     condition="TM4C123x" />
        <file category="source" name="Device\Source\ARM\startup_TM4C129.s"     attr="config"     condition="TM4C129x" />

        <!-- system file -->
        <file category="source" name="Device\Source\system_TM4C123.c"          attr="config"     condition="TM4C123x" />
        <file category="source" name="Device\Source\system_tm4c129.c"          attr="config"     condition="TM4C129x" />
      </files>
    </component>

  </components>


</package>
